In [1]:
import pandas as pd

pd.Series([100,500,150])

0    100
1    500
2    150
dtype: int64

In [2]:
pd.Series([100,500,150], index = ['카카오', '삼성전자', '현대차'])

카카오     100
삼성전자    500
현대차     150
dtype: int64

In [4]:
series_ex1 = pd.Series([100,500,150], index = ['카카오', '삼성전자', '현대차'])
print(series_ex1['카카오'])
print(series_ex1['현대차'])
print(series_ex1[1])

100
150
500

In [5]:
pd.DataFrame({'가격' : [100,500,150],
              'PER' : [0.5,1.2,0.2],
              'ROA' : [1.01,  3.1,0.97]},
              index = ['카카오', '삼성전자', '현대차'])

       가격  PER   ROA
카카오   100  0.5  1.01
삼성전자  500  1.2  3.10
현대차   150  0.2  0.97

In [6]:
df_ex1 = pd.DataFrame({'가격' : [100,500,150],
              'PER' : [0.5,1.2,0.2],
              'ROA' : [1.01,  3.1,0.97]},
              index = ['카카오', '삼성전자', '현대차'])
df_ex1['가격']
# 2차원 데이터를 표현해주는 데이터프레임을 1차원으로 쪼개면 시리즈가 나타난다.
# 다시말해 데이터프레임은 시리즈의 집합

카카오     100
삼성전자    500
현대차     150
Name: 가격, dtype: int64

In [7]:
df_ex1['가격']['삼성전자']

500

In [8]:
# 행을 기준으로 데이터를 가져오고 싶을 때, loc를 사용
df_ex1.loc['카카오']

가격     100.00
PER      0.50
ROA      1.01
Name: 카카오, dtype: float64

In [9]:
df_ex1.loc['카카오']['ROA']

1.01

In [12]:
df_ex2 = pd.DataFrame({'가격' : [100,140,155,70,90],
                      'PER' : [1.1, 0.8, 0.7, 2.3, 3.9],
                      '거래량' : [1000, 800, 890, 700, 2000]},
                     index = ['a','b','c','d','e'])
df_ex2

    가격  PER   거래량
a  100  1.1  1000
b  140  0.8   800
c  155  0.7   890
d   70  2.3   700
e   90  3.9  2000

In [13]:
df_ex2[df_ex2['가격']>=100]

    가격  PER   거래량
a  100  1.1  1000
b  140  0.8   800
c  155  0.7   890

In [15]:
df_ex2[df_ex2['거래량']<1000]

    가격  PER  거래량
b  140  0.8  800
c  155  0.7  890
d   70  2.3  700

In [16]:
# PER 기준으로 정렬
df_ex2['PER'].sort_values()

c    0.7
b    0.8
a    1.1
d    2.3
e    3.9
Name: PER, dtype: float64

In [18]:
# 내림차순으로 정렬
df_ex2['PER'].sort_values(ascending = False)

e    3.9
d    2.3
a    1.1
b    0.8
c    0.7
Name: PER, dtype: float64

In [19]:
df_ex2.sort_values(by = 'PER')

    가격  PER   거래량
c  155  0.7   890
b  140  0.8   800
a  100  1.1  1000
d   70  2.3   700
e   90  3.9  2000

In [20]:
df_ex2.sort_values(by = 'PER', ascending = False)

    가격  PER   거래량
e   90  3.9  2000
d   70  2.3   700
a  100  1.1  1000
b  140  0.8   800
c  155  0.7   890

In [21]:
# 마법공식으로 산출된 점수로 등수를 매길 때, 일일이 매기지 않아도 됌
df_ex2['거래량'].rank()

a    4.0
b    2.0
c    3.0
d    1.0
e    5.0
Name: 거래량, dtype: float64

In [24]:
file_path = 'C:/Users/elris/Dropbox/Data Scientist/Python/엑셀 데이터/주식 책 데이터/마법공식 데이터.xlsx'

df_per = pd.read_excel(file_path, sheet_name='PER')
df_per.head()

      회사명    PER
0      3S -11.87
1  AJ네트웍스  25.15
2   AJ렌터카  24.85
3   AK홀딩스  11.49
4  APS홀딩스   0.23

In [26]:
df_per = pd.read_excel(file_path, sheet_name='PER', index_col = 0)
df_per.head()

          PER
회사명
3S     -11.87
AJ네트웍스  25.15
AJ렌터카   24.85
AK홀딩스   11.49
APS홀딩스   0.23

In [28]:
filtered_per = df_per[df_per['PER']>0]
filtered_per.head()

          PER
회사명
AJ네트웍스  25.15
AJ렌터카   24.85
AK홀딩스   11.49
APS홀딩스   0.23
AP시스템   14.63

In [30]:
sorted_per = filtered_per.sort_values(by = 'PER')
sorted_per.head()

          PER
회사명
APS홀딩스   0.23
STX중공업   0.37
제일파마홀딩스  0.39
이녹스      0.75
유비쿼스홀딩스  1.04

In [34]:
sorted_per['PER'].rank().head()
# 결과가 시리즈로 나옴

회사명
APS홀딩스     1.0
STX중공업     2.0
제일파마홀딩스    3.0
이녹스        4.0
유비쿼스홀딩스    5.0
Name: PER, dtype: float64

In [38]:
sorted_per['PER랭킹'] = sorted_per['PER'].rank()
# 1차원의 시리즈를 기존에 있던 2차원의 데이터 프레임에 붙이는 형식으로 진행
sorted_per.head(10)
# 공동 6위를 차지한 두 회사가 6.5로 랭킹이 나타나 있음
# 둘을 6위로 두거나 7위로 둘 수 있는 옵션도 존재

           PER  PER랭킹
회사명
APS홀딩스    0.23    1.0
STX중공업    0.37    2.0
제일파마홀딩스   0.39    3.0
이녹스       0.75    4.0
유비쿼스홀딩스   1.04    5.0
삼강엠앤티     1.10    6.5
오리온홀딩스    1.10    6.5
크라운해태홀딩스  1.30    8.0
STX       1.61    9.0
현대시멘트     1.84   10.0

In [43]:
roa_data = pd.read_excel(file_path, sheet_name = 'ROA', index_col = 0)
roa_data.head(10)
# 엑셀 데이터에서 비어있기 때문에 nan이라고 뜸

        ROA(영업이익)(%)
회사명
3R               NaN
3S               NaN
3SOFT            NaN
3노드디지탈           NaN
AD모터스            NaN
AJS              NaN
AJ네트웍스          3.43
AJ렌터카           3.39
AK홀딩스          11.36
AP시스템          11.92

In [46]:
# 결측값이 있는 기업(행)들은 아예 제외
filtered_roa = roa_data.dropna()
filtered_roa.head(10)

         ROA(영업이익)(%)
회사명
AJ네트웍스           3.43
AJ렌터카            3.39
AK홀딩스           11.36
AP시스템           11.92
AP위성            -4.76
BGF리테일          15.29
BNK금융지주          0.87
BYC              0.99
C&S자산관리          0.61
CJ               5.90

In [48]:
# 칼럼의 개수만큼 일일이 다 리스트 안에 넣어줘야함. 여기서는 하나이기 때문에 하나면 쓴거
filtered_roa.columns = ['ROA']
filtered_roa.head()

          ROA
회사명
AJ네트웍스   3.43
AJ렌터카    3.39
AK홀딩스   11.36
AP시스템   11.92
AP위성    -4.76

In [50]:
sorted_roa = filtered_roa.sort_values(by = 'ROA', ascending = False)
sorted_roa.head()

            ROA
회사명
넥스턴       56.25
삼화네트웍스    50.18
오가닉티코스메틱  44.06
티웨이홀딩스    36.19
마이크로프랜드   34.58

In [53]:
sorted_roa['ROA랭킹'] = sorted_roa['ROA'].rank(ascending = False)
sorted_roa.head()

            ROA  ROA랭킹
회사명
넥스턴       56.25    1.0
삼화네트웍스    50.18    2.0
오가닉티코스메틱  44.06    3.0
티웨이홀딩스    36.19    4.0
마이크로프랜드   34.58    5.0

In [54]:
# how는 줄맞춤, 데이터가 서로 다른 개수의 열로 구성되어 있을 때, inner는 공통된 부분까지만 남기고 나머지는 자름
total_df = pd.merge(sorted_per, sorted_roa, how = 'inner', left_index = True, right_index = True)
total_df.head()

          PER  PER랭킹    ROA   ROA랭킹
회사명
AJ네트웍스  25.15  905.0   3.43   895.0
AJ렌터카   24.85  893.0   3.39   901.5
AK홀딩스   11.49  413.0  11.36   223.0
AP시스템   14.63  582.0  11.92   194.0
AP위성    21.65  818.0  -4.76  1676.0

In [58]:
total_df['종합랭크'] = (total_df['PER랭킹'] + total_df['ROA랭킹']).rank()
total_df.sort_values(by = '종합랭크').head(10)

           PER  PER랭킹    ROA  ROA랭킹  종합랭크
회사명
서한        3.22   22.0  23.65   25.0   1.0
골프존       4.19   38.0  24.77   21.0   2.0
동원개발      4.41   42.0  23.62   26.0   3.0
오가닉티코스메틱  5.11   66.5  44.06    3.0   4.0
모베이스      4.49   45.0  20.03   52.0   5.0
테라세미콘     6.07  104.0  31.98    7.0   6.0
제이스텍      3.88   32.0  17.05   85.5   7.0
삼목에스폼     4.98   58.0  18.98   64.0   8.0
영우디에스피    6.22  114.0  28.38   10.0   9.0
HB테크놀러지   6.45  123.5  30.60    9.0  10.0